{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "NHCW2Conv", 
      "name": "nhcw2conv1", 
      "attr": {
        "__predict__": "True", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "quantiinput0_input_shift_history", 
      "attr": {
        "__predict__": "True", 
        "fixed_output_shift": "7"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantiInput", 
      "name": "quantiinput0", 
      "attr": {
        "__predict__": "True", 
        "fixed_output_shift": "7"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(41, 5)", 
        "num_filter": "200", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(41, 5)", 
        "num_filter": "200", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(41, 5)", 
        "num_filter": "200", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "AlphaConvolution", 
      "name": "conv1", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(41, 5)", 
        "num_filter": "200", 
        "stride": "(1, 1)", 
        "use_activation": "True", 
        "vector_quanti": "True"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1], [8, 0, 1]]
    }, 
    {
      "op": "AlphaPooling", 
      "name": "alphapooling1", 
      "attr": {
        "__predict__": "True", 
        "kernel": "(1, 4)", 
        "pool_type": "max", 
        "stride": "(1, 4)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "QuantiFlatten", 
      "name": "flatten", 
      "attr": {"__predict__": "True"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected1_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected1_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected1_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected1_weight_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected1_bias_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantiFullyConnected", 
      "name": "quantifullyconnected1", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 1], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "QuantiActivation", 
      "name": "relu1", 
      "attr": {
        "__predict__": "True", 
        "act_type": "relu"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected2_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected2_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected2_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected2_weight_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected2_bias_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantiFullyConnected", 
      "name": "quantifullyconnected2", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 1], [22, 0, 1], [23, 0, 1]]
    }, 
    {
      "op": "QuantiActivation", 
      "name": "relu2", 
      "attr": {
        "__predict__": "True", 
        "act_type": "relu"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected3_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected3_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected3_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected3_weight_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected3_bias_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantiFullyConnected", 
      "name": "quantifullyconnected3", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 1], [29, 0, 1], [30, 0, 1]]
    }, 
    {
      "op": "QuantiActivation", 
      "name": "relu3", 
      "attr": {
        "__predict__": "True", 
        "act_type": "relu"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected4_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected4_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected4_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected4_weight_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected4_bias_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantiFullyConnected", 
      "name": "quantifullyconnected4", 
      "attr": {
        "__predict__": "True", 
        "num_hidden": "256", 
        "vector_quanti": "True"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 1], [36, 0, 1], [37, 0, 1]]
    }, 
    {
      "op": "QuantiActivation", 
      "name": "relu4", 
      "attr": {
        "__predict__": "True", 
        "act_type": "relu"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected5_weight", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected5_bias", 
      "attr": {"__predict__": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected5_output_shift_history", 
      "attr": {
        "__predict__": "True", 
        "disable_output_quantization": "True", 
        "num_hidden": "5", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected5_weight_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "disable_output_quantization": "True", 
        "num_hidden": "5", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "quantifullyconnected5_bias_vec_shift_history", 
      "attr": {
        "__predict__": "True", 
        "disable_output_quantization": "True", 
        "num_hidden": "5", 
        "vector_quanti": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "QuantiFullyConnected", 
      "name": "quantifullyconnected5", 
      "attr": {
        "__predict__": "True", 
        "disable_output_quantization": "True", 
        "num_hidden": "5", 
        "vector_quanti": "True"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0], [42, 0, 1], [43, 0, 1], [44, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "attr": {
        "__predict__": "True", 
        "use_ignore": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "attr": {
        "__predict__": "True", 
        "use_ignore": "True"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    4, 
    5, 
    6, 
    7, 
    8, 
    12, 
    13, 
    14, 
    15, 
    16, 
    19, 
    20, 
    21, 
    22, 
    23, 
    26, 
    27, 
    28, 
    29, 
    30, 
    33, 
    34, 
    35, 
    36, 
    37, 
    40, 
    41, 
    42, 
    43, 
    44, 
    46
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48
  ], 
  "heads": [[47, 0, 0]], 
  "attrs": {
    "build_version": ["str", "nnvm_1.3.0 commit 0cccda77ff995ed274c46a8d45430f8e817633c7 Merge: 12c11b1 0479cd9 Author: shuqian.qu <shuqian.qu@hobot.cc>"], 
    "mxnet_version": ["int", 10300]
  }
}