/*
	Copyright (C) 2007-2019 Apple Inc. All Rights Reserved. Not to be used or disclosed without permission from Apple.
*/

#ifndef __AirPlayCommon_h__
#define __AirPlayCommon_h__

#include "CommonServices.h"

#if 0
#pragma mark == Configuration ==
#endif

//===========================================================================================================================
//	Configuration
//===========================================================================================================================

#if (1 && !defined(AIRPLAY_CONFIG_FILE_PATH))
#define AIRPLAY_CONFIG_FILE_PATH "/etc/airplay.conf"
#endif

// AIRPLAY_HTTP_SERVER_LEGACY: 1=Support legacy HTTP server port. 0=Only one, kAirPlayFixedPort_MediaControl(7000) port is supported.

#if (!defined(AIRPLAY_HTTP_SERVER_LEGACY))
#define AIRPLAY_HTTP_SERVER_LEGACY 0
#endif

// AIRPLAY_THREADED_MAIN: 1=Run AirPlay's "main" function in its own thread instead of exporting main (for non-process OS's).

#if (!defined(AIRPLAY_THREADED_MAIN))
#define AIRPLAY_THREADED_MAIN 0
#endif

// AIRTUNES_DYNAMIC_PORTS: 1=Bind to dynamic ports. 0=bind to fixed ports.

#if (!defined(AIRTUNES_DYNAMIC_PORTS))
#define AIRTUNES_DYNAMIC_PORTS 1
#endif

#define AIRPLAY_SDK_REVISION "AirPlay;2.0.4"
#define AIRPLAY_SDK_BUILD "28.0"
#define AIRPLAY_RAOP_SERVER 1
#define AIRPLAY_ALAC 1
#define AIRPLAY_AAC_ELD 0
#define AIRPLAY_AAC_LC 1
#define AIRPLAY_VOLUME_CONTROL 1
#define AIRPLAY_GENERAL_AUDIO_SKEW 1
#define AIRPLAY_RAMSTAD_SRC 1

#define kAirPlayTransferPriority_NiceToHave 100 // Transfer succeeds only if constraint is <= Anytime.
#define kAirPlayTransferPriority_UserInitiated 500 // Transfer succeeds only if constraint is <= UserInitiated.

#define kAirPlayTransferPriorityString_NotApplicable "n/a"
#define kAirPlayTransferPriorityString_NiceToHave "niceToHave"
#define kAirPlayTransferPriorityString_UserInitiated "userInitiated"

#define AirPlayTransferPriorityFromString(X) MapStringToValue((X), kAirPlayTransferPriority_NotApplicable, \
    kAirPlayTransferPriorityString_NiceToHave, kAirPlayTransferPriority_NiceToHave,                        \
    kAirPlayTransferPriorityString_UserInitiated, kAirPlayTransferPriority_UserInitiated,                  \
    NULL)

#define AirPlayTransferPriorityToString(X) ( \
    ((X) == kAirPlayTransferPriority_NotApplicable) ? kAirPlayTransferPriorityString_NotApplicable : ((X) == kAirPlayTransferPriority_NiceToHave) ? kAirPlayTransferPriorityString_NiceToHave : ((X) == kAirPlayTransferPriority_UserInitiated) ? kAirPlayTransferPriorityString_UserInitiated : "?")

// AirPlayTransferType

typedef int32_t AirPlayTransferType;
#define kAirPlayTransferType_NotApplicable 0
#define kAirPlayTransferType_Take 1 // Transfer ownership permanently.
#define kAirPlayTransferType_Untake 2 // Release permanent ownership.
#define kAirPlayTransferType_Borrow 3 // Transfer ownership temporarily.
#define kAirPlayTransferType_Unborrow 4 // Release temporary ownership.

#define kAirPlayTransferTypeString_NotApplicable "n/a"
#define kAirPlayTransferTypeString_Take "take"
#define kAirPlayTransferTypeString_Untake "untake"
#define kAirPlayTransferTypeString_Borrow "borrow"
#define kAirPlayTransferTypeString_Unborrow "unborrow"

#define AirPlayTransferTypeFromString(X) MapStringToValue((X), kAirPlayTransferType_NotApplicable, \
    kAirPlayTransferTypeString_Take, kAirPlayTransferType_Take,                                    \
    kAirPlayTransferTypeString_Untake, kAirPlayTransferType_Untake,                                \
    kAirPlayTransferTypeString_Borrow, kAirPlayTransferType_Borrow,                                \
    kAirPlayTransferTypeString_Unborrow, kAirPlayTransferType_Unborrow,                            \
    NULL)

#define AirPlayTransferTypeToString(X) ( \
    ((X) == kAirPlayTransferType_NotApplicable) ? kAirPlayTransferTypeString_NotApplicable : ((X) == kAirPlayTransferType_Take) ? kAirPlayTransferTypeString_Take : ((X) == kAirPlayTransferType_Untake) ? kAirPlayTransferTypeString_Untake : ((X) == kAirPlayTransferType_Borrow) ? kAirPlayTransferTypeString_Borrow : ((X) == kAirPlayTransferType_Unborrow) ? kAirPlayTransferTypeString_Unborrow : "?")

// AirPlayTriState

typedef int32_t AirPlayTriState;
#define kAirPlayTriState_NotApplicable 0
#define kAirPlayTriState_False -1
#define kAirPlayTriState_True 1

#define AirPlayTriStateToString(X) ( \
    ((X) == kAirPlayTriState_NotApplicable) ? "n/a" : ((X) == kAirPlayTriState_False) ? "false" : ((X) == kAirPlayTriState_True) ? "true" : "?")

// Changes

typedef struct
{
    AirPlayTransferType type;
    AirPlayTransferPriority priority;
    AirPlayConstraint takeConstraint; // If "take", constraint for peer to take. Missing otherwise.
    AirPlayConstraint borrowOrUnborrowConstraint; // If "take", constraint for peer to borrow. Missing otherwise.
    // If "borrow", constraint for peer to unborrow. Missing otherwise.
} AirPlayResourceChange;

typedef struct
{
    AirPlayResourceChange screen;
    AirPlayResourceChange mainAudio;
    AirPlaySpeechMode speech;
    AirPlayTriState phoneCall;
    AirPlayTriState turnByTurn;

} AirPlayModeChanges;

#define AirPlayModeChangesInit(PTR) memset((PTR), 0, sizeof(*(PTR)))

// State

typedef struct
{
    AirPlayEntity entity;
    AirPlaySpeechMode mode;

} AirPlaySpeechState;

typedef struct
{
    AirPlayEntity screen; // Owner of the screen.
    AirPlayEntity mainAudio; // Owner of main audio.
    AirPlayEntity phoneCall; // Owner of phone call.
    AirPlaySpeechState speech; // Owner of speech and its mode.
    AirPlayEntity turnByTurn; // Owner of navigation.

} AirPlayModeState;

#define AirPlayModeStateInit(PTR) memset((PTR), 0, sizeof(*(PTR)))

#if 0
#pragma mark -
#pragma mark == Packets - RTP ==
#endif

//===========================================================================================================================
//	RTP Packets
//===========================================================================================================================

// RFC 3550 Section 5.1: RTP Packet
//
//  0                   1                   2                   3
//  0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
// +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+    +0/0x00
// |V=2|P|X|  CC   |M|     PT      |       sequence number         |
// +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+    +4/0x04
// |                           timestamp                           |
// +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+    +8/0x08
// |           synchronization source (SSRC) identifier            |
// +=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+   +12/0x0C
// |                                                               |
// |                            payload                            |
// |                                                               |
// +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +1440/0x5A0

#define kRTPHeaderSize 12

#define RTPHeaderInsertVersion(FIELDS, X) (((FIELDS) & ~0xC0) | (((X) << 6) & 0xC0))
#define RTPHeaderExtractVersion(FIELDS) (((FIELDS) >> 6) & 0x03)
#define kRTPVersion 2

#define RTPHeaderInsertMarker(FIELDS, X) (((FIELDS) & ~0x80) | (((X) << 7) & 0x80))
#define RTPHeaderExtractMarker(FIELDS) (((FIELDS) >> 7) & 0x01)

#define RTPHeaderInsertPayloadType(FIELDS, X) (((FIELDS) & ~0x7F) | ((X)&0x7F))
#define RTPHeaderExtractPayloadType(FIELDS) ((FIELDS)&0x7F)

typedef struct
{
    uint8_t v_p_x_cc; // Version (V), Padding (P), Extension (X), and Contributing Sources Count (CC) fields.
    uint8_t m_pt; // Marker(M) and Payload(PT). For Buffered AirPlay the high byte of 24 bit seq
    uint16_t seq; // Sequence Number
    uint32_t ts; // Timestamp
    uint32_t ssrc; // Synchronization Source (SSRC) Identifier

} RTPHeader;

check_compile_time(offsetof(RTPHeader, m_pt) == 1);
check_compile_time(offsetof(RTPHeader, seq) == 2);
check_compile_time(offsetof(RTPHeader, ts) == 4);
check_compile_time(offsetof(RTPHeader, ssrc) == 8);
check_compile_time(sizeof(RTPHeader) == 12);

typedef struct
{
    RTPHeader header; // [0x00] 12-byte RTP header.
    uint8_t payload[1]; // [0x0C] Variable length payload.

} RTPPacket;

check_compile_time(offsetof(RTPPacket, header) == 0);
check_compile_time(offsetof(RTPPacket, payload) == 12);

typedef struct
{
    union {
        uint32_t align;
        RTPPacket rtp;
        uint8_t bytes[kAirTunesMaxPacketSizeUDP];

    } pkt;

    size_t len;
    uint32_t sampleCount;

} RTPSavedPacket;

#if 0
#pragma mark -
#pragma mark == Packets - RTCP ==
#endif

//===========================================================================================================================
//	RTCP Packets
//===========================================================================================================================

// RTCPType

typedef enum {
    kRTCPTypeAny = 0,

    kRTCPTypeSR = 200, // Sender Report
    kRTCPTypeRR = 201, // Receiver Report
    kRTCPTypeSDES = 202, // Source Description
    kRTCPTypeBye = 203,
    kRTCPTypeApp = 204,

    // Extensions

    kRTCPTypeTimeSyncRequest = 210, // RTCPTimeSyncPacket
    kRTCPTypeTimeSyncResponse = 211, // RTCPTimeSyncPacket
    kRTCPTypeTimeAnnounce = 212, // RTCPTimeAnnouncePacket
    kRTCPTypeRetransmitRequest = 213, // RTCPRetransmitRequestPacket
    kRTCPTypeRetransmitResponse = 214, // RTCPRetransmitResponsePacket
    kRTCPTypePTPTimeAnnounce = 215 // RTCPTimePTPAnnouncePacket
} RTCPType;

// RFC 3550 Section 6.4: RTCP Common Header
//
//         0                   1                   2                   3
//         0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +0/0x00
// header |V=2|P|  count  |      PT       |           length              |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +4/0x04

#define RTCPHeaderInsertVersion(FIELDS, X) (((FIELDS) & ~0xC0) | (((X) << 6) & 0xC0))
#define RTCPHeaderExtractVersion(FIELDS) (((FIELDS) >> 6) & 0x03)
#define kRTCPVersion 2

#define RTCPHeaderInsertCount(FIELDS, X) (((FIELDS) & ~0x1F) | ((X)&0x1F))
#define RTCPHeaderExtractCount(FIELDS) ((FIELDS)&0x1F)

typedef struct
{
    uint8_t v_p_c; // Version (V), Padding (P), and Count (C) fields.
    uint8_t pt; // RTCP packet type
    uint16_t length; // Packet length in 32-bit words - 1.

} RTCPCommonHeader;

check_compile_time(offsetof(RTCPCommonHeader, pt) == 1);
check_compile_time(offsetof(RTCPCommonHeader, length) == 2);
check_compile_time(sizeof(RTCPCommonHeader) == 4);

// AirTunes Receiver Report Packet
//
//         0                   1                   2                   3
//         0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +0/0x00
// RTSP   |      '$'      |  Channel ID   |       Length in bytes         |
//        +=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+  +4/0x04
// RTCP   |V=2|P|    RC   |   PT=RR=201   |             length            |
// header +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +8/0x08
//        |                     SSRC of packet sender                     |
//        +=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+ +12/0x0C
// report |                 SSRC_1 (SSRC of first source)                 |
// block  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +16/0x10
//   1    | fraction lost |       cumulative number of packets lost       |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +20/0x14
//        |           extended highest sequence number received           |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +24/0x18
//        |                      interarrival jitter                      |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +28/0x1C
//        |                         last SR (LSR)                         |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +32/0x20
//        |                   delay since last SR (DLSR)                  |
//        +=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+ +36/0x24
// ROAP   |       extension length        | ext. version  |      pad      |
// Ext.   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +40/0x28
//        |                     last timestamp received                   |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +44/0x2C
//        |                       output buffer frames                    |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +48/0x30
//        |                        output buffer size                     |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +52/0x34
//        |                         hardware latency                      |
//        +=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+=+ +56/0x38

typedef struct
{
    // RTSP Header

    uint8_t signature; // '$'
    uint8_t channelID; // 0 for data, 1 for control
    uint16_t rtspLength; // Number of bytes in payload section.

    // RTCP Header

    uint8_t v_p_c; // Version (V), Padding (P), and Count (C) fields.
    uint8_t pt; // RTCP packet type
    uint16_t length; // Packet length in 32-bit words - 1.
    uint32_t ssrc; // SSRC of packet sender.

    // RTCP Receiver Report

    uint32_t ssrc1; // SSRC of first source.
    uint32_t lost; // 8 bit fraction list since last report; 24 bit cumulative packets (signed).
    uint32_t lastSeq; // Extended sequence number last received.
    uint32_t jitter; // Inter-arrival jitter.
    uint32_t lsr; // Last SR packet from this source.
    uint32_t dlsr; // Delay since last SR packet.

    // ROAP Extension

    uint16_t extensionLength; // Length of extension in bytes.
    uint8_t extensionVersion; // Version of the extension (currently 1).
    uint8_t extensionPad; // Pad to 32-bit boundary.
    uint32_t lastRTPTimeStampReceived; // Last RTP time stamp received.
    uint32_t framesInOutputBuffer; // Number of audio frames currently in the output buffer.
    uint32_t maxFramesInOutputBuffer; // Number of audio frames the output buffer can hold.
    uint32_t hardwareLatency; // Latency of the output hardware in frames.

} AirTunesReceiverReportFields;

check_compile_time(offsetof(AirTunesReceiverReportFields, signature) == 0);
check_compile_time(offsetof(AirTunesReceiverReportFields, channelID) == 1);
check_compile_time(offsetof(AirTunesReceiverReportFields, rtspLength) == 2);
check_compile_time(offsetof(AirTunesReceiverReportFields, v_p_c) == 4);
check_compile_time(offsetof(AirTunesReceiverReportFields, pt) == 5);
check_compile_time(offsetof(AirTunesReceiverReportFields, length) == 6);
check_compile_time(offsetof(AirTunesReceiverReportFields, ssrc) == 8);
check_compile_time(offsetof(AirTunesReceiverReportFields, ssrc1) == 12);
check_compile_time(offsetof(AirTunesReceiverReportFields, lost) == 16);
check_compile_time(offsetof(AirTunesReceiverReportFields, lastSeq) == 20);
check_compile_time(offsetof(AirTunesReceiverReportFields, jitter) == 24);
check_compile_time(offsetof(AirTunesReceiverReportFields, lsr) == 28);
check_compile_time(offsetof(AirTunesReceiverReportFields, dlsr) == 32);
check_compile_time(offsetof(AirTunesReceiverReportFields, extensionLength) == 36);
check_compile_time(offsetof(AirTunesReceiverReportFields, extensionVersion) == 38);
check_compile_time(offsetof(AirTunesReceiverReportFields, extensionPad) == 39);
check_compile_time(offsetof(AirTunesReceiverReportFields, lastRTPTimeStampReceived) == 40);
check_compile_time(offsetof(AirTunesReceiverReportFields, framesInOutputBuffer) == 44);
check_compile_time(offsetof(AirTunesReceiverReportFields, maxFramesInOutputBuffer) == 48);
check_compile_time(offsetof(AirTunesReceiverReportFields, hardwareLatency) == 52);
check_compile_time(sizeof(AirTunesReceiverReportFields) == 56);

typedef union {
    uint32_t align; // Force 32-bit alignment.
    uint8_t bytes[1]; // Raw bytes.
    AirTunesReceiverReportFields fields;

} AirTunesReceiverReport;

check_compile_time(offsetof(AirTunesReceiverReport, bytes) == 0);
check_compile_time(offsetof(AirTunesReceiverReport, fields) == 0);
check_compile_time(sizeof(AirTunesReceiverReport) == 56);

// RTCPTimeSync Packet
//
//         0                   1                   2                   3
//         0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +0/0x00
// header |V=2|P|M|   0   |      PT       |           length              |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +4/0x04
// timing |           RTP timestamp at NTP Transit (T3) time              |
// info   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +8/0x08
//        |      NTP Originate (T1) timestamp, most  significant word     |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +12/0x0C
//        |      NTP Originate (T1) timestamp, least significant word     |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +16/0x10
//        |      NTP Receive   (T2) timestamp, most  significant word     |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +20/0x14
//        |      NTP Receive   (T2) timestamp, least significant word     |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +24/0x18
//        |      NTP Transmit  (T3) timestamp, most  significant word     |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +28/0x1C
//        |      NTP Transmit  (T3) timestamp, least significant word     |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +32/0x20

#define RTCPTimeSyncInsertMarker(FIELDS, X) (((FIELDS) & ~0x10) | (((X) << 4) & 0x10))
#define RTCPTimeSyncExtractMarker(FIELDS) (((FIELDS) >> 4) & 0x01)

typedef struct
{
    uint8_t v_p_m; // Version (V), Padding (P), and Marker (M) fields.
    uint8_t pt; // RTCP packet type.
    uint16_t length; // Packet length in 32-bit words - 1.

    uint32_t rtpTimestamp; // RTP timestamp at the same instant as ntpTransmitHi/Lo (clients should use 0).
    uint32_t ntpOriginateHi; // Transmit time from the original client request (clients should use 0).
    uint32_t ntpOriginateLo;
    uint32_t ntpReceiveHi; // Time request received by the server (clients should use 0).
    uint32_t ntpReceiveLo;
    uint32_t ntpTransmitHi; // Time client request or server response sent.
    uint32_t ntpTransmitLo;

} RTCPTimeSyncPacket;

check_compile_time(offsetof(RTCPTimeSyncPacket, pt) == 1);
check_compile_time(offsetof(RTCPTimeSyncPacket, length) == 2);
check_compile_time(offsetof(RTCPTimeSyncPacket, rtpTimestamp) == 4);
check_compile_time(offsetof(RTCPTimeSyncPacket, ntpOriginateHi) == 8);
check_compile_time(offsetof(RTCPTimeSyncPacket, ntpOriginateLo) == 12);
check_compile_time(offsetof(RTCPTimeSyncPacket, ntpReceiveHi) == 16);
check_compile_time(offsetof(RTCPTimeSyncPacket, ntpReceiveLo) == 20);
check_compile_time(offsetof(RTCPTimeSyncPacket, ntpTransmitHi) == 24);
check_compile_time(offsetof(RTCPTimeSyncPacket, ntpTransmitLo) == 28);
check_compile_time(sizeof(RTCPTimeSyncPacket) == 32);

// RTCPTimeAnnounce Packet
//
//         0                   1                   2                   3
//         0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +0/0x00
// header |V=2|P|M|   0   |      PT       |           length              |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +4/0x04
// timing |                         RTP timestamp                         |
// info   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +8/0x08
//        |                   NTP timestamp, high 32 bits                 |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +12/0x0C
//        |                   NTP timestamp, low 32 bits                  |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +16/0x10
//        |     RTP timestamp when the new timeline should be applied     |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +20/0x14

#define RTCPTimeAnnounceInsertMarker(FIELDS, X) (((FIELDS) & ~0x10) | (((X) << 4) & 0x10))
#define RTCPTimeAnnounceExtractMarker(FIELDS) (((FIELDS) >> 4) & 0x01)

typedef struct
{
    uint8_t v_p_m; // Version (V), Padding (P), and Marker (M) fields.
    uint8_t pt; // RTCP packet type.
    uint16_t length; // Packet length in 32-bit words - 1.

    uint32_t rtpTime; // RTP timestamp at the NTP timestamp.
    uint32_t ntpTimeHi; // NTP timestamp at the RTP timestamp (high 32 bits).
    uint32_t ntpTimeLo; // NTP timestamp at the RTP timestamp (low 32 bits).
    uint32_t rtpApply; // RTP timestamp when the new timeline should be applied.

} RTCPTimeAnnouncePacket;

check_compile_time(offsetof(RTCPTimeAnnouncePacket, pt) == 1);
check_compile_time(offsetof(RTCPTimeAnnouncePacket, length) == 2);
check_compile_time(offsetof(RTCPTimeAnnouncePacket, rtpTime) == 4);
check_compile_time(offsetof(RTCPTimeAnnouncePacket, ntpTimeHi) == 8);
check_compile_time(offsetof(RTCPTimeAnnouncePacket, ntpTimeLo) == 12);
check_compile_time(offsetof(RTCPTimeAnnouncePacket, rtpApply) == 16);
check_compile_time(sizeof(RTCPTimeAnnouncePacket) == 20);

#if (PRAGMA_PACKPUSH)
#pragma pack(push, 4)
#elif (PRAGMA_PACK)
#pragma pack(4)
#else
#warning "FIX ME: packing not supported by this compiler"
#endif

typedef struct {
    uint8_t v_p_m; // Version (V), Padding (P), and Marker (M) fields.
    uint8_t pt; // RTCP packet type.
    uint16_t length; // Packet length in 32-bit words - 1.

    uint32_t rtpTime; // RTP timestamp at the NTP timestamp.
    uint64_t ptpTime; // PTP timestamp at the RTP timestamp.
    uint32_t rtpApply; // RTP timestamp when the new timeline should be applied.
    uint64_t ptpGrandmasterID; // PTP Grandmaster ID used to derive ptpTime.
} RTCP_PTPTimeAnnouncePacket;

check_compile_time(offsetof(RTCP_PTPTimeAnnouncePacket, pt) == 1);
check_compile_time(offsetof(RTCP_PTPTimeAnnouncePacket, length) == 2);
check_compile_time(offsetof(RTCP_PTPTimeAnnouncePacket, rtpTime) == 4);
check_compile_time(offsetof(RTCP_PTPTimeAnnouncePacket, ptpTime) == 8);
check_compile_time(offsetof(RTCP_PTPTimeAnnouncePacket, rtpApply) == 16);
check_compile_time(offsetof(RTCP_PTPTimeAnnouncePacket, ptpGrandmasterID) == 20);
check_compile_time(sizeof(RTCP_PTPTimeAnnouncePacket) == 28);

#if (PRAGMA_PACKPUSH)
#pragma pack(pop)
#elif (PRAGMA_PACK)
#pragma pack()
#else
#warning "FIX ME: packing not supported by this compiler"
#endif

// RTCP Retransmit Request Packet
//
//             0                   1                   2                   3
//             0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
//            +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +0/0x00
// header     |V=2|P|    0    |    PT=213     |           length              |
//            +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +4/0x04
// retransmit |     Sequence Number Start     |         Packet Count          |
// info       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +8/0x08
//            |            Optional NTP Nanoseconds High 32 bits              |
//            +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +12/0x0C
//            |            Optional NTP Nanoseconds Low  32 bits              |
//            +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +16/0x10

typedef struct
{
    uint8_t v_p; // Version (V) and Padding (P) fields.
    uint8_t pt; // RTCP packet type (kRTCPTypeRetransmitRequest)
    uint16_t length; // Packet length in 32-bit words - 1.

    uint16_t seqStart; // First packet to retransmit.
    uint16_t seqCount; // Number of packets to retransmit.

    uint32_t ntpHi; // OPTIONAL: High 32 bits of a 64-bit NTP-sync'd nanoseconds at time of request.
    uint32_t ntpLo; // OPTIONAL: Low  32 bits of a 64-bit NTP-sync'd nanoseconds at time of request.

} RTCPRetransmitRequestPacket;

#define kRTCPRetransmitRequestPacketMinSize offsetof(RTCPRetransmitRequestPacket, ntpHi)
#define kRTCPRetransmitRequestPacketNTPSize sizeof(RTCPRetransmitRequestPacket)

check_compile_time(offsetof(RTCPRetransmitRequestPacket, pt) == 1);
check_compile_time(offsetof(RTCPRetransmitRequestPacket, length) == 2);
check_compile_time(offsetof(RTCPRetransmitRequestPacket, seqStart) == 4);
check_compile_time(offsetof(RTCPRetransmitRequestPacket, seqCount) == 6);
check_compile_time(offsetof(RTCPRetransmitRequestPacket, ntpHi) == 8);
check_compile_time(offsetof(RTCPRetransmitRequestPacket, ntpLo) == 12);
check_compile_time(sizeof(RTCPRetransmitRequestPacket) == 16);

// RTCP Retransmit Response Packet
//
//             0                   1                   2                   3
//             0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
//            +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+     +0/0x00
// header     |V=2|P|    0    |    PT=214     |           length              |
//            +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+     +4/0x0C
// retransmit |                                                               |
// info       |                      original RTP packet                      |
//            |                                                               |
//            +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +1444/0x5A4

typedef struct
{
    uint8_t v_p; // Version (V) and Padding (P) fields.
    uint8_t pt; // RTCP packet type (kRTCPTypeRetransmitResponse)
    uint16_t length; // Packet length in 32-bit words - 1.

} RTCPRetransmitResponseHeader;

check_compile_time(offsetof(RTCPRetransmitResponseHeader, v_p) == 0);
check_compile_time(offsetof(RTCPRetransmitResponseHeader, pt) == 1);
check_compile_time(offsetof(RTCPRetransmitResponseHeader, length) == 2);
check_compile_time(sizeof(RTCPRetransmitResponseHeader) == 4);

typedef struct
{
    uint16_t seq; // Sequence number of packet that couldn't be delivered.
    uint16_t pad; // Pad to 32-bit boundary. Must be 0.

} RTCPRetransmitResponseFail;

check_compile_time(offsetof(RTCPRetransmitResponseFail, seq) == 0);
check_compile_time(offsetof(RTCPRetransmitResponseFail, pad) == 2);
check_compile_time(sizeof(RTCPRetransmitResponseFail) == 4);

typedef union {
    uint8_t bytes[1440];
    RTPPacket rtp;
    RTCPRetransmitResponseFail fail;

} RTCPRetransmitResponsePayload;

check_compile_time(offsetof(RTCPRetransmitResponsePayload, bytes) == 0);
check_compile_time(offsetof(RTCPRetransmitResponsePayload, rtp) == 0);
check_compile_time(offsetof(RTCPRetransmitResponsePayload, fail) == 0);
check_compile_time(sizeof(RTCPRetransmitResponsePayload) == 1440);

typedef struct
{
    uint8_t v_p; // Version (V) and Padding (P) fields.
    uint8_t pt; // RTCP packet type (kRTCPTypeRetransmitResponse)
    uint16_t length; // Packet length in 32-bit words - 1.
    RTCPRetransmitResponsePayload payload;

} RTCPRetransmitResponsePacket;

check_compile_time(offsetof(RTCPRetransmitResponsePacket, pt) == 1);
check_compile_time(offsetof(RTCPRetransmitResponsePacket, length) == 2);
check_compile_time(offsetof(RTCPRetransmitResponsePacket, payload) == 4);
check_compile_time(sizeof(RTCPRetransmitResponsePacket) == 1444);

//	RTCP Futile Retransmit Response Packet:
//
//				0                   1                   2                   3
//				0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
//			   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +0/0x00
//	header     |V=2|P|    0    |    PT=214     |          length=1             |
//			   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +4/0x04
//	retransmit |       sequence number         |             pad               |
//	info       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+  +8/0x08

typedef struct
{
    uint8_t v_p; // [0x00] Version (V) and Padding (P) fields.
    uint8_t pt; // [0x01] RTCP packet type (kRTCPTypeRetransmitResponse)
    uint16_t length; // [0x02] Packet length in 32-bit words - 1 = 1.
    uint16_t seq; // [0x04] Sequence number of packet that couldn't be delivered.
    uint16_t pad; // [0x06] Pad to 32-bit boundary. Must be 0.
    // [0x08] Total

} RTCPFutileRetransmitResponsePacket;

check_compile_time(offsetof(RTCPFutileRetransmitResponsePacket, v_p) == 0);
check_compile_time(offsetof(RTCPFutileRetransmitResponsePacket, pt) == 1);
check_compile_time(offsetof(RTCPFutileRetransmitResponsePacket, length) == 2);
check_compile_time(offsetof(RTCPFutileRetransmitResponsePacket, seq) == 4);
check_compile_time(offsetof(RTCPFutileRetransmitResponsePacket, pad) == 6);
check_compile_time(sizeof(RTCPFutileRetransmitResponsePacket) == 8);

// RTCP Packet Union (for easier access to packet-specific data).

typedef union {
    uint32_t align; // Force 4-byte alignment.
    RTCPCommonHeader header;
    RTCPTimeSyncPacket timeSync;
    RTCPTimeAnnouncePacket timeAnnounce;
    RTCP_PTPTimeAnnouncePacket ptpTimeAnnounce;
    RTCPRetransmitRequestPacket retransmitReq;
    RTCPRetransmitResponsePacket retransmitAck;
    RTCPFutileRetransmitResponsePacket futileAck;

} RTCPPacket;

#if 0
#pragma mark -
#pragma mark == Packets - Keep Alive ==
#endif

//===========================================================================================================================
//	Keep Alive Packet
//===========================================================================================================================

// Idle keep alive packet
//
//         0                   1                   2                   3
//         0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +0/0x00
//        |V=0|S|    0    |Length in bytes|         session ID            |
//        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ +4/0x04

typedef struct
{
    uint8_t v_s; // Version (V) and Sleep (S) fields.
    uint8_t length; // Packet length in bytes.
    uint16_t sessionID; // SessionID.
} AirPlayIdleKeepAlivePacket;

check_compile_time(offsetof(AirPlayIdleKeepAlivePacket, v_s) == 0);
check_compile_time(offsetof(AirPlayIdleKeepAlivePacket, length) == 1);
check_compile_time(offsetof(AirPlayIdleKeepAlivePacket, sessionID) == 2);
check_compile_time(sizeof(AirPlayIdleKeepAlivePacket) < 32); //UDP_KEEPALIVE_OFFLOAD_DATA_SIZE

#define AirPlayIdleKeepAliveInsertVersion(FIELDS, X) (((FIELDS) & ~0xC0) | (((X) << 6) & 0xC0))
#define AirPlayIdleKeepAliveExtractVersion(FIELDS) (((FIELDS) >> 6) & 0x03)
#define kAirPlayIdleKeepAliveVerion 0

#define AirPlayIdleKeepAliveInsertSleep(FIELDS, X) (((FIELDS) & ~0x20) | (((X) << 5) & 0x20))
#define AirPlayIdleKeepAliveExtractSleep(FIELDS) (((FIELDS) >> 5) & 0x01)

#if 0
#pragma mark -
#pragma mark == Packets - Screen ==
#endif

//===========================================================================================================================
//	Screen Packets
//===========================================================================================================================

#define kAirPlayScreenOpCode_VideoFrame 0
#define kAirPlayScreenOpCode_VideoConfig 1
#define kAirPlayScreenOpCode_KeepAlive 2
#define kAirPlayScreenOpCode_ForceKeyFrame 3
#define kAirPlayScreenOpCode_Ignore 4
#define kAirPlayScreenOpCode_KeepAliveWithBody 5

#define kAirPlayScreenFlag_ShowHUD (1 << 0) // 1=Show diagnostic HUD on receiver.
#define kAirPlayScreenFlag_RespectTimestamps (1 << 1) // 1=Display frames at the specified time. 0=Display immediately.
#define kAirPlayScreenFlag_Encrypted (1 << 2) // 1=Frame is encrypted.
#define kAirPlayScreenFlag_Unused3 (1 << 3) // Never used in production software.
#define kAirPlayScreenFlag_Unused4 (1 << 4) // Unused as of 2011-07-25.
#define kAirPlayScreenFlag_Suspended (1 << 5) // 1=Suspend display. 0=Resume display.
#define kAirPlayScreenFlag_ClearScreen (1 << 6) // 1=Clear screen to black. 0=Restore screen.
#define kAirPlayScreenFlag_InterestingFrame (1 << 7) // 1=Frame is interesting for logging.
#define kAirPlayScreenFlag2_NoDisplaySleep (1 << 0) // 1=Prevent the screen saver from coming up on the receiver.

#define kAirPlayRemoteLog_Off 0x00
#define kAirPlayRemoteLogFlag_EveryFrame 0x01
#define kAirPlayRemoteLogFlag_Periodic 0x02
#define kAirPlayRemoteLogFlag_InterestingFrames 0x04

typedef struct
{
    uint32_t bodySize;
    uint8_t opcode;
    uint8_t smallParam[3];
    Value64 params[15];

} AirPlayScreenHeader;

check_compile_time(offsetof(AirPlayScreenHeader, bodySize) == 0);
check_compile_time(offsetof(AirPlayScreenHeader, opcode) == 4);
check_compile_time(offsetof(AirPlayScreenHeader, smallParam) == 5);
check_compile_time(offsetof(AirPlayScreenHeader, params) == 8);
check_compile_time(sizeof(AirPlayScreenHeader) == 128);

#if 0
#pragma mark -
#pragma mark == Properties ==
#endif

//===========================================================================================================================
//	Properties
//===========================================================================================================================
#define kAirPlayProperty_AudioMode "audioMode"
#define kAirPlayAudioMode_Default 0 // Default Mode
#define kAirPlayAudioMode_MoviePlayback 1 // Optimized for movie playback

#define kAirPlayProperty_Password "Password"

// [Array of dictionaries] Supported formats.
// Each dictionary contains the following keys:
//		kAirPlayKey_Type
//		[kAirPlayKey_AudioInputFormats]
//		[kAirPlayKey_AudioOutputFormats]
#define kAirPlayProperty_AudioFormats "audioFormats"

// [String] Status of the audio jack (connected/disconnect) and optionally a type of connection (analog/digital).
